#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.visitor_counter will be created
  + resource "aws_dynamodb_table" "visitor_counter" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "page_id"
      + id               = (known after apply)
      + name             = "homepage-visitor-table"
      + read_capacity    = (known after apply)
      + region           = "us-west-2"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Homepage Visitor Counter"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Homepage Visitor Counter"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "page_id"
          + type = "S"
        }

      + global_secondary_index (known after apply)

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption (known after apply)

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @s-meenaghan7, Action: `pull_request`, Workflow: `Terraform Deploy`*